W11D3/BenchBnB/benchBnB/app/models/user.rb

  def reset_session_token
    self.update(session_token: SecureRandom.urlsafe_base64)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "edv5Y97JbCJq1OQiEZNLww"], ["updated_at", "2019-10-31 17:21:46.055259"], ["id", 1]]