W11D3/BenchBnB/benchBnB/app/controllers/api/benches_controller.rb

    def create
        debugger
        @bench = Bench.new(bench_params)

        if @bench.save
---
INSERT INTO "benches" ("description", "lat", "lng", "created_at", "updated_at", "seating") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "bench8"], ["lat", 37.7755116719495], ["lng", -122.4156022644043], ["created_at", "2019-11-02 00:02:59.432078"], ["updated_at", "2019-11-02 00:02:59.432078"], ["seating", 2]]