W11D3/BenchBnB/benchBnB/app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "edv5Y97JbCJq1OQiEZNLww"], ["updated_at", "2019-10-31 17:21:46.055259"], ["id", 1]]
---
  def create
    @user = User.create(user_params)

    if @user.save